## Plan Result (Test - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * module.public-dns.azurerm_role_assignment.dnszonecontributer
  * module.test.azurerm_role_assignment.dnszonecontributer
  * module.test-apps-public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/perftest.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/3b2719b8-ba0f-9c4c-84ae-3a12ca905d2d" -> (known after apply)
      ~ name                                   = "3b2719b8-ba0f-9c4c-84ae-3a12ca905d2d" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/perftest.platform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/perftest.platform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.test.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/test.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/a2cf2e71-d187-2a15-8aea-605cc98b59f8" -> (known after apply)
      ~ name                                   = "a2cf2e71-d187-2a15-8aea-605cc98b59f8" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/test.platform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/test.platform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.test-apps-public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/test.apps.hmcts.net/providers/Microsoft.Authorization/roleAssignments/6b3ddb57-753e-25a6-c398-f6ed9da958c8" -> (known after apply)
      ~ name                                   = "6b3ddb57-753e-25a6-c398-f6ed9da958c8" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/test.apps.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/test.apps.hmcts.net" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2020,"Program":"tfcmt","SHA1":"","Target":"Test - TerraformPlanApply","Vars":{}} -->